{
    "professional_summary": "Automation Developer with hands-on experience in Python-based test automation, AI agent workflows, and RPA. Skilled in developing and testing developer interfaces, APIs, and multi-agent systems. Experienced in building mock services, integrating tests into CI/CD pipelines, and validating AI model outputs. Proven ability to collaborate across technical and non-technical teams, with a focus on quality, reliability, and continuous improvement in AI-driven environments.",
    "cv_job_experience": "August 2025 - Present\n  Self-Directed Projects & AI/Agentic Automation Development and Cybersecurity\n  • Developed AI-powered automation workflows using LangChain to orchestrate LLM-based tasks, including note rewriting and automatic flashcard creation.\n  • Built and tested agentic automation systems for personal productivity, demonstrating real-world AI agent behavior and workflow integration.\n  • Practiced web exploitation and security testing through HTB Certified Web Exploitation Specialist course, applying security principles to automation design.\n\nJanuary 2023 – August 2025\n  Software Developer & Support Manager, Digia Finland Oy\n  • Designed and deployed Python-based RPA solutions, including API integrations and database interactions, to automate enterprise workflows.\n  • Maintained a large-scale enterprise file transfer/transform system, ensuring data accuracy and secure handling of sensitive information.\n  • Collaborated with technical and business teams to refine automation logic, improve scalability, and validate API functionality.\n  • Supported citizen developers in automation projects, including documentation and troubleshooting.\n  • Rebuilt and managed client relationships through technical demonstrations and solution proposals.\n\nMay 2017 - August 2021 (Summers while studying for B.sC in Mech. Eng.)\n  Mechanical Engineering Trainee, Wärtsilä Oy\n  • Conducted engineering calculations and system tuning for engine projects.\n  • Managed technical documentation and supported installation and calibration tasks across international client projects.\n\nLeadership Experience\n  Finnish Army Reserves (Dragsviikin Maakuntajoukkue)\n    • Led a platoon of 30 personnel in high-pressure environments, managing training, logistics, and operations.\n    • Developed strategic thinking and problem-solving skills applicable to cross-functional technical teams.",
    "skills": "Python, pytest, unittest, mock, asyncio, REST APIs, GraphQL, WebSockets, Docker, CI/CD, Git, version control, API testing, SDK testing, UI testing, data schemas, OpenAPI, prompt engineering, RAG, vector databases, LangChain, LangGraph, multi-agent system architecture, LLM orchestration, AI agents, agentic automation, process optimization, Pandas, SQL, Microsoft Azure, AWS, Bash, JavaScript/TypeScript (Fullstack), Selenium, PyAutoGUI, N8N, HuggingFace, Ollama, security testing, HTB Certified Web Exploitation Specialist",
    "suggested_skills": [
        "locust",
        "k6",
        "async/event-driven testing",
        "performance testing",
        "LLM testing",
        "agent frameworks",
        "cloud AI platforms",
        "ML frameworks"
    ],
    "key_achievements": "• Delivered multiple full-cycle automation projects with measurable efficiency gains, including client-facing RPA solutions.\n• Built and tested agentic workflows using LangChain for personal productivity, demonstrating LLM orchestration and task chaining.\n• Mentored citizen developers in automation practices, improving team-wide adoption of scripting and workflow tools.\n• Applied security principles from cybersecurity training to automation design, ensuring robustness and data integrity.",
    "job_application_business_name": "Quadcode"
}