{
    "professional_summary": "Automation Developer with hands-on experience in agentic AI systems, AI-driven process automation, and LLM orchestration using Python. Skilled in building and deploying AI agents, integrating with frameworks like LangChain, and designing intelligent workflows. Experienced in full-stack development with JavaScript/TypeScript, containerization with Docker, and working in collaborative, agile environments. Proven ability to deliver scalable automation solutions and mentor non-technical teams in adopting AI-powered tools.",
    "cv_job_experience": "August 2025 - Present\nSelf-Directed Projects & AI/Agentic Automation Development and Cybersecurity\n  • Developed an AI-powered study assistant using LangChain, integrating with Anki to automate flashcard creation and learning workflows.\n  • Built multiple agentic automation workflows demonstrating LLM orchestration and context-aware task execution in real-world applications.\n  • Practicing in cybersecurity labs and preparing for advanced certifications (CPTS/OSCP), applying knowledge of secure system design.\n\nJanuary 2023 - August 2025\nSoftware Developer & Support Manager, Digia Finland Oy\n  • Designed, developed, and deployed full RPA automation solutions using Python and automation frameworks, delivering 3–5 projects annually with measurable efficiency improvements.\n  • Maintained and enhanced a large-scale enterprise file transfer/transform system (project value €500,000+), ensuring data integrity and protection of sensitive information.\n  • Collaborated with cross-functional teams to integrate APIs, databases, and automation logic, improving system scalability and reliability.\n  • Led knowledge-sharing sessions and supported citizen developers in adopting automation practices.\n  • Rebuilt and managed client relationships through technical proposals and solution demonstrations.\n\nMay 2017 - August 2021 (Summers while studying for B.Sc. in Mech. Eng.)\nMechanical Engineering Trainee, Wärtsilä Oy\n  • Conducted engineering calculations and system tuning for engine projects.\n  • Managed technical documentation and supported installation and calibration tasks across international client deployments.\n\nLeadership Experience\nFinnish Army Reserves (Dragsviikin Maakuntajoukkue)\n  • Led a platoon of 30 personnel, managing training, logistics, and operations under high-pressure conditions.\n  • Developed strategic thinking, teamwork, and problem-solving skills applicable to technical team environments.",
    "skills": "• RPA & Automation and scripting: Python, UiPath (familiar), Selenium, PyAutoGUI, LangChain, N8N, Bash\n• AI & Automation: AI agents, agentic automation, process optimization, LangChain, Huggingface, Ollama, LangGraph, multi-agent system architecture, RAG, vector databases\n• Software Development: JavaScript/TypeScript (Fullstack), Docker\n• Data & Systems: Pandas, OpenPyXL, SQL, Microsoft Azure, AWS, PyPDF2\n• Cybersecurity & Networking: CompTIA Network+, Security+, Pentest+, HTB Certified Web Exploitation Specialist (CWES)\n• Familiar technologies and keywords: APIs, backend, frontend, version control, prompt engineering, asynchronous programming, CI/CD, monitoring, observability",
    "suggested_skills": [
        "TypeScript",
        "NodeJS",
        "WordPress",
        "Docker/Kubernetes",
        "CI/CD pipelines",
        "Monitoring and observability tools",
        "LangGraph",
        "vector databases"
    ],
    "key_achievements": "• Delivered multiple full-cycle automation projects with measurable efficiency gains, including AI-powered workflow automation using LangChain.\n• Mentored and supported citizen developers in adopting automation and AI tools.\n• Proactively developed and tested agentic workflows for personal use, including automated note rewriting, flashcard generation, and analytical tasks using LLM orchestration.\n• Applied cybersecurity knowledge in practical labs and certification preparation, reinforcing secure system design principles.",
    "job_application_business_name": "Zoner"
}