{
    "professional_summary": "Integration-focused Automation Developer with hands-on experience in RPA, API-driven automation, and AI orchestration using Python and LangChain. Proven ability to maintain, troubleshoot, and optimize enterprise-scale integrations, with a strong foundation in JSON, REST, and secure data handling. Skilled in collaborating across technical and business teams, supporting users, and delivering scalable, resilient automation solutions. Experienced in documentation, knowledge sharing, and continuous improvement initiatives. Strong analytical mindset with a focus on root cause analysis, system thinking, and proactive service enhancement.",
    "cv_job_experience": "August 2025 - Present\nSelf-Directed Projects & AI/Agentic Automation Development and Cybersecurity\n  • Developed an autonomous remediation agent that performs security scanning, generates secure code patches via local LLM inference, computes confidence from historical success/failure memory, auto-merges safe fixes, and escalates low-confidence cases to developers\n  • Completed HTB Certified Web Exploitation Specialist course; currently practicing in labs and preparing for advanced certifications (CPTS/OSCP)\n  • Built an AI-powered study assistant integrated with Anki using LangChain to streamline learning and workflow automation\n  • Designed and implemented multiple agentic automation workflows to demonstrate AI orchestration in practical applications\n\nJanuary 2023 - August 2025\nSoftware Developer & Support Manager, Digia Finland Oy\n  • Designed, developed, and deployed full RPA automation solutions independently using Python and automation frameworks, delivering 3–5 projects annually and saving clients hundreds to thousands of hours\n  • Maintained and supported a large-scale enterprise file transfer/transform system (project value €500,000+), ensuring data accuracy, operational continuity, and robust protection of highly sensitive data\n  • Collaborated with business and technical teams to refine automation logic, improve scalability, and integrate APIs and databases\n  • Led knowledge-sharing sessions and supported colleagues and citizen developers in process automation projects\n  • Rebuilt and managed key client relationships, securing multiple new contracts through technical meetings and solution proposals\n\nMay 2017 - August 2021 (Summers while studying for B.Sc. in Mech. Eng.)\nMechanical Engineering Trainee, Wärtsilä Oy\n  • Conducted engineering calculations and system tuning for Wärtsilä engine projects\n  • Managed documentation and supported installation/calibration tasks across international client projects\n\nLeadership Experience\nFinnish Army Reserves (Dragsviikin Maakuntajoukkue)\n  • Led a platoon of 30 personnel, managing training, logistics, and operations under high-stress conditions\n  • Developed leadership, teamwork, strategic thinking, and problem-solving skills applicable to cross-functional technical teams",
    "skills": "• RPA & Automation and scripting: Python, UiPath (familiar), Selenium, PyAutoGUI, LangChain, N8N, Bash\n• AI & Automation: AI agents, agentic automation, process optimization, LangChain, LangGraph, Huggingface, Ollama\n• Software Development: JavaScript/TypeScript (Fullstack), Docker\n• Data & Systems: Pandas, OpenPyXL, SQL, Microsoft Azure, AWS, PyPDF2\n• Completed courses in Cybersecurity & Networking: CompTIA Network+, Security+, Pentest+, HTB Certified Web Exploitation Specialist (CWES)\n• Familiar technologies and keywords: LangGraph, multi-agent system architecture, APIs, backend, frontend, version control, prompt engineering, RAG, vector databases",
    "suggested_skills": [
        "REST",
        "JSON",
        "XML",
        "APIs",
        "ITSM tools",
        "ServiceNow",
        "Jira",
        "Zendesk",
        "BMC",
        "log analysis",
        "message flows",
        "root cause analysis",
        "documentation",
        "knowledge sharing",
        "continuous improvement",
        "customer-facing communication",
        "scalable solutions",
        "resilient systems",
        "integration maintenance",
        "change request estimation"
    ],
    "key_achievements": "• Delivered multiple full-cycle automation projects with measurable efficiency gains\n• Mentored and supported citizen developers in adopting automation practices\n• Balanced hands-on technical work with leadership, collaboration, and continuous learning\n• Proactively developed and tested agentic workflows for personal use—automating note rewriting, automatic flashcard creation, and analytical tasks using LLM orchestration",
    "job_application_business_name": "ONEiO"
}